IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f280015x_cpu_sys_regs.xml
	<register id="LSEN" width="32" page="1" offset="0x82" internal="0" description="Lockstep enable configuration">
		<bitfield id="Enable" description="Lockstep Enable" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CMPSSLPMSEL" width="32" page="1" offset="0x84" internal="0" description="CMPSS LPM Wakeup select registers">
		<bitfield id="CMPSS1H" description="CMPSS1H Enable for LPM Wakeup" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS1L" description="CMPSS1L Enable for LPM Wakeup" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS2H" description="CMPSS2H Enable for LPM Wakeup" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS2L" description="CMPSS2L Enable for LPM Wakeup" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS3H" description="CMPSS3H Enable for LPM Wakeup" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS3L" description="CMPSS3L Enable for LPM Wakeup" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS4H" description="CMPSS4H Enable for LPM Wakeup" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS4L" description="CMPSS4L Enable for LPM Wakeup" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="MCANWAKESTATUS" width="32" page="1" offset="0x98" internal="0" description="MCAN Wake Status Register">
		<bitfield id="WAKE" description="MCAN Wake Status " begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="MCANWAKESTATUSCLR" width="32" page="1" offset="0x9a" internal="0" description="MCAN Wake Status Clear Register">
		<bitfield id="WAKE" description="Cear bit for MCANWAKESTATUS.WAKE bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CLKSTOPREQ" width="32" page="1" offset="0x9c" internal="0" description="Peripheral Clock Stop Request Register">
		<bitfield id="MCAN_A" description="MCAN_A Clock Stop Request Bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Key for register write " begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CLKSTOPACK" width="32" page="1" offset="0x9e" internal="0" description="Peripheral Clock Stop Ackonwledge Register">
		<bitfield id="MCAN_A" description="MCAN_A Clock Stop Ack Bit" begin="8" end="8" width="1" rwaccess="R"/>
	</register>
	<register id="USER_REG1_SYSRSn" width="32" page="1" offset="0xa0" internal="0" description="Software Configurable registers reset by SYSRSn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="USER_REG2_SYSRSn" width="32" page="1" offset="0xa2" internal="0" description="Software Configurable registers reset by SYSRSn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="USER_REG1_XRSn" width="32" page="1" offset="0xa4" internal="0" description="Software Configurable registers reset by XRSn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="USER_REG2_XRSn" width="32" page="1" offset="0xa6" internal="0" description="Software Configurable registers reset by XRSn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="USER_REG1_PORESETn" width="32" page="1" offset="0xa8" internal="0" description="Software Configurable registers reset by PORESETn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="USER_REG2_PORESETn" width="32" page="1" offset="0xaa" internal="0" description="Software Configurable registers reset by PORESETn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="USER_REG3_PORESETn" width="32" page="1" offset="0xac" internal="0" description="Software Configurable registers reset by PORESETn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="USER_REG4_PORESETn" width="32" page="1" offset="0xae" internal="0" description="Software Configurable registers reset by PORESETn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
</module>
